app/controllers/todos_controller.rb

  def index
  	#@todo_item = "Learn ROR"
  	#@todo_list = ["Learn Ruby","Learn Rails","Take Test","Go to Colombia"]
  	@todo_list = Todo.all
---
SELECT "todos".* FROM "todos"

  def delete
  	@id = params[:format]
  	Todo.find(@id).destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 4]]
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", nil]]

  def add
  	@task = user_params[:todo_item]
  	t = Todo.create(:todo_item => @task)
---
INSERT INTO "todos" ("todo_item", "created_at", "updated_at") VALUES (?, ?, ?)  [["todo_item", "Test for add success"], ["created_at", "2015-02-26 11:35:14.325078"], ["updated_at", "2015-02-26 11:35:14.325078"]]

  def complete
  	id = params[:todos_checkbox]
  	if id
  		id.each do |i|
  			t = Todo.find(i)
  			t.completed = true
  			t.save
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", "t"], ["updated_at", "2015-02-26 13:49:31.755638"], ["id", 6]]